Repository: AkaAnto/django-models
Catalog: docs_src/source/locale/*/LC_MESSAGES/features.po
Languages: pt_br

source: Model to return a dict with all data of your django instance without a serializer.
pt_br: Modelo com o metodo serialize que retorna um dict com todas as informações da instância sem precisar de um serializador configurado.

source: Example:
pt_br: Exemplo:

source: **Your Model**
pt_br: **Seus Modelo**

source: **Usage**
pt_br: **Uso**

source: Model with a slug field. Useful to use in urls or nominal references
pt_br: Modelo com um campo slug. util para se usar em urls ou referencias nominais

source: Model with the DateTime, created_at and updated_at fields. Useful to control when any changes were made.
pt_br: Modelo com os campos Datetime, created_at and updated_at. Uteis para controlar quando uma instancia foi criada ou aterada.

source: Model that uses the id field as a UUID. Useful to be able to have a unique identifier without worrying about sequences.
pt_br: Modelo que usa o campo id como um UUID. Util para poder ter um identificador único sem se preocupar com sequenciais.

source: Model that track each save to generate a History Changes of a record
pt_br: Modelo que permite rastrear cada alteração feita na instância ao salvar para gerar um Historico de modificações da instância

source: With SignalModel it allows you to handle or execute an event according to Django's Signals.
pt_br: Usando o SignalsModel, permite que você manipule ou execute um evento de acordo com os Signals do Django.

source: On Save:
pt_br: Ao Salvar

source: pre_save (Before Saving)
pt_br: pre_save (Antes de Salvar)

source: post_save (After saving)
pt_br: post_save (Depois de Salvar)

source: On Erase:
pt_br: Ao Apagar

source: pre_delete (Before Erasing)
pt_br: pre_delete (Antes de Apagar)

source: post_delete (After Deleting)
pt_br: post_delete (Depois de Apagar)

source: Example using Pre-save signal
pt_br: Examplo usando o signal Pre-save

source: It is the SignalsModel with soft delete implemented. Allows nothing you delete to be really deleted from the system and easy to recover
pt_br: É o SignalsModel com soft delete implementado. Permite que nada que você apague seja realmente apagado do sistema e de facil recuperação
